<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Suitcase Fusion 6.</string>
	<key>Identifier</key>
	<string>com.biscuitgmbh.download.SuitcaseFusion6</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Suitcase Fusion 6</string>
		<key>SPARKLE_FEED_URL</key>
		<string>http://sparkle.extensis.com/u/ST/DE/suitcase17de.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
					<string>%pathname%</string>
				<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>DISABLE_CODE_SIGNATURE_VERIFICATION </key>
			</true>
			<key>Processor</key>
				<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
